{
  "menu": {
    "about": "A propos",
    "projects": "Projets",
    "contact": "Contact",
    "login": "Connexion"
  },
  "themeToggler": {
    "theme": "Theme",
    "light": "Clair",
    "dark": "Sombre",
    "system": "Systeme"
  },
  "homePage": {
    "section1": "Ce site web est bien plus qu’un simple portfolio — c’est aussi un projet personnel que j’ai développé en <b>apprenant Next.js par moi-même</b>. Je voulais créer quelque chose qui <b>mette en valeur à la fois mes compétences et ma capacité à apprendre et utiliser de nouvelles technologies</b>.",
    "section2": "Le site comporte deux parties : une section publique où vous pouvez en apprendre plus sur moi et découvrir les projets sur lesquels j’ai travaillé, et un <b>dashboard d’administration privé</b> qui fonctionne comme un mini CMS. Ce back-office me permet de gérer dynamiquement le contenu de la page « Projets ».",
    "section3": "Bien que le site soit entièrement fonctionnel, je le considère comme un <b>travail en cours</b>. Il reste des aspects que je souhaite améliorer, que ce soit au niveau de la structure du code, de l’optimisation des performances ou des bonnes pratiques de développement. C’est aussi pour cela que je l’ai créé : pour <b>expérimenter, apprendre et perfectionner</b>. Le code source complet est <a>disponible sur GitHub</a>, n’hésitez pas à explorer comment il est construit et à suivre son évolution.",
    "section4": "Je m'appelle <b>Antonin Billot</b>, je suis développeur logiciel français avec <b>3 à 4 ans d'expérience professionnelle</b> dans le développement d'applications web et mobiles.",
    "section5": "J'ai commencé ma carrière chez <b>Bleu122</b>, une petite entreprise française spécialisée dans la création de solutions numériques sur mesure pour ses clients. Là-bas, j'ai eu l'opportunité de travailler sur une grande variété de projets, ce qui m'a permis de progresser tant sur le plan technique que professionnel.",
    "section6": "Mon parcours dans le développement a commencé avec une forte envie de <b>résoudre des problèmes concrets grâce à des solutions pratiques</b>. L’un de mes premiers projets personnels était une application pour gérer mes idées et objectifs personnels — avec rappels récurrents et suivi d’habitudes. J’ai aussi créé un prototype d’application familiale de catalogage de livres, conçue pour scanner les codes-barres et remplir automatiquement les métadonnées via des APIs externes.",
    "section7": "Lors de mes premières années d’études, j’ai appris les bases du développement web — HTML, CSS, JavaScript et PHP. Pour concrétiser mes idées personnelles, j’ai <b>appris Java et Kotlin en autodidacte</b> pour le développement mobile, puis j’ai ajouté <b>React et Node.js</b> afin de créer des applications web modernes et des APIs.",
    "section8": "Cette passion m’a finalement amené à poursuivre une troisième phase d’études supérieures, axée sur le développement d’applications mobiles. J’ai effectué ma dernière année en alternance chez Bleu122, où on m’a proposé un poste à temps plein après l’obtention de mon diplôme.",
    "section9": "Chez Bleu122, j'ai travaillé en tant que <b>développeur fullstack en utilisant des technologies comme Grails (Groovy/Java), Vue.js et Flutter</b>. J'ai particulièrement apprécié travailler sur une variété de projets différents, chacun avec ses propres défis et exigences — ce qui m'a beaucoup appris en peu de temps.",
    "section10": "Ce qui <b>me motive le plus dans la programmation</b>, c’est le processus qui permet de passer d’un problème à une solution pleinement fonctionnelle. Il y a quelque chose de très satisfaisant à voir un projet prendre forme <b>étape par étape</b>. Si mon expérience jusqu’ici s’est surtout concentrée sur la livraison de <b>produits fonctionnels et visuellement aboutis</b>, je souhaite désormais <b>approfondir mon expertise</b> sur la qualité logicielle : <i>code propre, bons workflows de développement (PRs, CI/CD) et pratiques de tests (unitaires et fonctionnels)</i>.",
    "section11": "Je suis passionné par la création d’expériences numériques significatives et j’ai hâte de rejoindre une équipe où je pourrai continuer à apprendre, évoluer et contribuer à des projets logiciels de haute qualité."
  },
  "contactPage":{
    "title": "Me contacter",
    "subtitle": "Je suis activement à la recherche de nouvelles opportunités professionnelles.<br /> Contactez-moi via le formulaire ci-dessous si vous souhaitez discuter d’un poste, d’un projet ou simplement échanger.",
    "from_label": "Email",
    "from_placeholder": "Entrez votre adresse e-mail",
    "message_label": "Message",
    "message_placeholder": "Ecrivez votre message ici.",
    "send_button_cta": "Envoyer"
  },
  "loginPage": {
    "title": "Dashboard administrateur",
    "subtitle": "Veuillez vous connecter pour accéder à la plateforme d'administration.",
    "email": "Email",
    "email_placeholder": "Entrez votre adresse e-mail",
    "password": "Mot de passe",
    "password_placeholder": "Entrez votre mot de passe",
    "login_button_cta": "Se connecter"
  },
  "dashboardPage": {
    "navlinks": {
      "home": "Dashboard",
      "projects": "Projets",
      "technos": "Technologies"
    },
    "signout": "Se déconnecter"
  },
  "dashboardTechnos": {
    "index": {
      "title" : "Technologies",
      "create-button": "Créer une techno",
      "name-column-title": "Nom",
      "actions-column-title": "Actions"
    },
    "create": {
      "title": "Créer une techno",
      "name-label": "Nom",
      "name-placeholder": "Entrer un nom",
      "logo-label": "Logo"
    },
    "edit": {
      "title": "Modifier la techno : {name}"
    },
    "delete-dialog": {
      "title": "Supprimer cette techno ?",
      "description": "Vous allez supprimer la techno <b>{name}</b>. Êtes-vous certain(e) ? Cette action est irréversible."
    }
  },
  "dashboardProjects": {
    "index": {
      "title" : "Projets",
      "create-button": "Créer un projet",
      "name-column-title": "Nom",
      "actions-column-title": "Actions"
    },
    "create": {
      "title": "Créer un project",
      "name-label": "Nom",
      "name-placeholder": "Entrer un nom",
      "year-label": "Année",
      "support-label": "Support",
      "description-label": "Description",
      "technos-label": "Technologies utilisées",
      "images-label": "Images"
    },
    "edit": {
      "title": "Modifier le projet : {name}",
      "images": "Images"
    },
    "delete-dialog": {
      "title": "Supprimer ce projet ?",
      "description": "Vous allez supprimer le projet <b>{name}</b>. Êtes-vous certain(e) ? Cette action est irréversible."
    },
    "delete-image-dialog": {
      "title": "Supprimer cette image ?",
      "description": "Vous allez supprimer une image. Êtes-vous certain(e) ? Cette action est irréversible."
    }
  },
  "mobile": "Mobile",
  "web": "Web",
  "back": "Retour",
  "validate": "Valider",
  "cancel": "Annuler"
}